In [2]:
!pip install pyspark

Successfully built pyspark
Installing collected packages: py4j, pyspark
Successfully installed py4j-0.10.9.7 pyspark-3.5.2

[notice] A new release of pip is available: 24.1.2 -> 24.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [4]:
 pip install --upgrade pip

Installing collected packages: pip
  Attempting uninstall: pip
    Found existing installation: pip 24.1.2
    Uninstalling pip-24.1.2:
      Successfully uninstalled pip-24.1.2
Successfully installed pip-24.2
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pyspark

In [3]:
import pandas as pd 
pd.read_csv('Book1.csv')

       Name  age
0     Rohan   23
1  Sudanshu   30
2     sunny   29

In [1]:
 from pyspark.sql import SparkSession

In [3]:
spark=SparkSession.builder.appName('Practise').getOrCreate()

In [4]:
spark

In [29]:
##read the dataset to 
df_pyspark=spark.read.csv("Book1.csv",header=True,inferSchema=True)

In [28]:
df_pyspark.show()

+--------+---+----------+
|     _c0|_c1|       _c2|
+--------+---+----------+
|    Name|age|experience|
|   Rohan| 23|        10|
|Sudanshu| 30|         8|
|   sunny| 29|         4|
+--------+---+----------+

In [66]:
#read the data set with first row of file being header
df_pyspark=spark.read.option('header','true').csv("Book1.csv",inferSchema=True)

In [40]:
df_pyspark

DataFrame[Name: string, age: int, experience: int, Salary: int]

In [7]:
type(df_pyspark)

pyspark.sql.dataframe.DataFrame

In [41]:
##to print the schema
df_pyspark.printSchema()

root
 |-- Name: string (nullable = true)
 |-- age: integer (nullable = true)
 |-- experience: integer (nullable = true)
 |-- Salary: integer (nullable = true)

In [42]:
##to get all column names
df_pyspark.columns

['Name', 'age', 'experience', 'Salary']

In [43]:
##to get head
df_pyspark.head(3)

[Row(Name='Rohan', age=23, experience=10, Salary=30000),
 Row(Name='Sudanshu', age=30, experience=8, Salary=25000),
 Row(Name='Sunny', age=29, experience=4, Salary=20000)]

In [44]:
##to get single column
df_pyspark.select('Name').show()

+--------+
|    Name|
+--------+
|   Rohan|
|Sudanshu|
|   Sunny|
|    Paul|
|  Harsha|
| Shubham|
|  Mahesh|
|    NULL|
|    NULL|
+--------+

In [45]:
##to ge multiple columns
df_pyspark.select(['Name','Experience']).show()

+--------+----------+
|    Name|Experience|
+--------+----------+
|   Rohan|        10|
|Sudanshu|         8|
|   Sunny|         4|
|    Paul|         3|
|  Harsha|         1|
| Shubham|         2|
|  Mahesh|      NULL|
|    NULL|        10|
|    NULL|      NULL|
+--------+----------+

In [46]:
#to check datatypes
df_pyspark.dtypes

[('Name', 'string'), ('age', 'int'), ('experience', 'int'), ('Salary', 'int')]

In [47]:
#describe 
df_pyspark.describe().show()

+-------+------+------------------+------------------+-----------------+
|summary|  Name|               age|        experience|           Salary|
+-------+------+------------------+------------------+-----------------+
|  count|     7|                 8|                 7|                8|
|   mean|  NULL|              27.5| 5.428571428571429|          25750.0|
| stddev|  NULL|5.5805785670356025|3.8234863173611093|9361.776388210581|
|    min|Harsha|                21|                 1|            15000|
|    max| Sunny|                36|                10|            40000|
+-------+------+------------------+------------------+-----------------+

In [30]:
##adding columns in data frame
df_pyspark=df_pyspark.withColumn('Experience After 2 year',df_pyspark['Experience']+2)

In [31]:
df_pyspark.show()

+--------+---+----------+-----------------------+
|    Name|age|experience|Experience After 2 year|
+--------+---+----------+-----------------------+
|   Rohan| 23|        10|                     12|
|Sudanshu| 30|         8|                     10|
|   sunny| 29|         4|                      6|
+--------+---+----------+-----------------------+

In [32]:
##drop the columns
df_pyspark=df_pyspark.drop("Experience after 2 year")

In [34]:
df_pyspark.show()

+--------+---+----------+
|    Name|age|experience|
+--------+---+----------+
|   Rohan| 23|        10|
|Sudanshu| 30|         8|
|   sunny| 29|         4|
+--------+---+----------+

In [48]:
##rename the columns
df_pyspark=df_pyspark.withColumnRenamed('Name','New Name')

In [52]:
df_pyspark.show()

+--------+----+----------+------+
|    Name| age|experience|Salary|
+--------+----+----------+------+
|   Rohan|  23|        10| 30000|
|Sudanshu|  30|         8| 25000|
|   Sunny|  29|         4| 20000|
|    Paul|  24|         3| 20000|
|  Harsha|  21|         1| 15000|
| Shubham|  23|         2| 18000|
|  Mahesh|NULL|      NULL| 40000|
|    NULL|  34|        10| 38000|
|    NULL|  36|      NULL|  NULL|
+--------+----+----------+------+

In [51]:
df_pyspark=df_pyspark.withColumnRenamed('New Name','Name')

In [69]:
##handling missing values
df_pyspark.na.drop().show()

+--------+---+----------+------+
|    Name|age|experience|Salary|
+--------+---+----------+------+
|   Rohan| 23|        10| 30000|
|Sudanshu| 30|         8| 25000|
|   Sunny| 29|         4| 20000|
|    Paul| 24|         3| 20000|
|  Harsha| 21|         1| 15000|
| Shubham| 23|         2| 18000|
+--------+---+----------+------+

In [70]:
###ANY==HOW
df_pyspark.na.drop(how='all').show()

+--------+----+----------+------+
|    Name| age|experience|Salary|
+--------+----+----------+------+
|   Rohan|  23|        10| 30000|
|Sudanshu|  30|         8| 25000|
|   Sunny|  29|         4| 20000|
|    Paul|  24|         3| 20000|
|  Harsha|  21|         1| 15000|
| Shubham|  23|         2| 18000|
|  Mahesh|NULL|      NULL| 40000|
|    NULL|  34|        10| 38000|
|    NULL|  36|      NULL|  NULL|
+--------+----+----------+------+

In [71]:
##threshold
df_pyspark.na.drop(how='any',thresh=3).show()

+--------+---+----------+------+
|    Name|age|experience|Salary|
+--------+---+----------+------+
|   Rohan| 23|        10| 30000|
|Sudanshu| 30|         8| 25000|
|   Sunny| 29|         4| 20000|
|    Paul| 24|         3| 20000|
|  Harsha| 21|         1| 15000|
| Shubham| 23|         2| 18000|
|    NULL| 34|        10| 38000|
+--------+---+----------+------+

In [72]:
##Subset
df_pyspark.na.drop(how="any",subset=['experience']).show()

+--------+---+----------+------+
|    Name|age|experience|Salary|
+--------+---+----------+------+
|   Rohan| 23|        10| 30000|
|Sudanshu| 30|         8| 25000|
|   Sunny| 29|         4| 20000|
|    Paul| 24|         3| 20000|
|  Harsha| 21|         1| 15000|
| Shubham| 23|         2| 18000|
|    NULL| 34|        10| 38000|
+--------+---+----------+------+

In [68]:
df_pyspark=spark.read.csv("Book1.csv",header=True,inferSchema=True)

In [76]:
##fill the missing value with something else than null
df_pyspark.na.fill("miss values").show()

+-----------+----+----------+------+
|       Name| age|experience|Salary|
+-----------+----+----------+------+
|      Rohan|  23|        10| 30000|
|   Sudanshu|  30|         8| 25000|
|      Sunny|  29|         4| 20000|
|       Paul|  24|         3| 20000|
|     Harsha|  21|         1| 15000|
|    Shubham|  23|         2| 18000|
|     Mahesh|NULL|      NULL| 40000|
|miss values|  34|        10| 38000|
|miss values|  36|      NULL|  NULL|
+-----------+----+----------+------+

In [77]:
df_pyspark.na.fill("miss values","experience").show()

+--------+----+----------+------+
|    Name| age|experience|Salary|
+--------+----+----------+------+
|   Rohan|  23|        10| 30000|
|Sudanshu|  30|         8| 25000|
|   Sunny|  29|         4| 20000|
|    Paul|  24|         3| 20000|
|  Harsha|  21|         1| 15000|
| Shubham|  23|         2| 18000|
|  Mahesh|NULL|      NULL| 40000|
|    NULL|  34|        10| 38000|
|    NULL|  36|      NULL|  NULL|
+--------+----+----------+------+

In [80]:
#to change the dtype 
df_pyspark = df_pyspark.withColumn("experience", df_pyspark["experience"].cast("string"))
df_pyspark.na.fill("miss values", ["experience"]).show()

+--------+----+-----------+------+
|    Name| age| experience|Salary|
+--------+----+-----------+------+
|   Rohan|  23|         10| 30000|
|Sudanshu|  30|          8| 25000|
|   Sunny|  29|          4| 20000|
|    Paul|  24|          3| 20000|
|  Harsha|  21|          1| 15000|
| Shubham|  23|          2| 18000|
|  Mahesh|NULL|miss values| 40000|
|    NULL|  34|         10| 38000|
|    NULL|  36|miss values|  NULL|
+--------+----+-----------+------+

In [81]:
df_pyspark = df_pyspark.withColumn("experience", df_pyspark["experience"].cast("int"))

In [88]:
df_pyspark

DataFrame[Name: string, age: int, experience: int, Salary: int]

In [83]:
import numpy as np

In [92]:
from pyspark.ml.feature import Imputer

# Initialize the Imputer
imputer = Imputer(inputCols=["age","experience","Salary"], outputCols=["age_imputed","exp_imputed","sal_imputed"]).setStrategy("mean")

# Fit and transform the dataframe
imputer.fit(df_pyspark).transform(df_pyspark).show()

+--------+----+----------+------+-----------+-----------+-----------+
|    Name| age|experience|Salary|age_imputed|exp_imputed|sal_imputed|
+--------+----+----------+------+-----------+-----------+-----------+
|   Rohan|  23|        10| 30000|         23|         10|      30000|
|Sudanshu|  30|         8| 25000|         30|          8|      25000|
|   Sunny|  29|         4| 20000|         29|          4|      20000|
|    Paul|  24|         3| 20000|         24|          3|      20000|
|  Harsha|  21|         1| 15000|         21|          1|      15000|
| Shubham|  23|         2| 18000|         23|          2|      18000|
|  Mahesh|NULL|      NULL| 40000|         27|          5|      40000|
|    NULL|  34|        10| 38000|         34|         10|      38000|
|    NULL|  36|      NULL|  NULL|         36|          5|      25750|
+--------+----+----------+------+-----------+-----------+-----------+

In [133]:
non_null=df_pyspark.na.drop()

In [134]:
non_null.show()

+--------+---+----------+------+
|    Name|age|experience|Salary|
+--------+---+----------+------+
|   Rohan| 23|        10| 30000|
|Sudanshu| 30|         8| 25000|
|   Sunny| 29|         4| 20000|
|    Paul| 24|         3| 20000|
|  Harsha| 21|         1| 15000|
| Shubham| 23|         2| 18000|
+--------+---+----------+------+

### filter operations

In [105]:
##salary of people less than or 20k
non_null.filter(non_null["Salary"]<=20000).show()

+-------+---+----------+------+
|   Name|age|experience|Salary|
+-------+---+----------+------+
|  Sunny| 29|         4| 20000|
|   Paul| 24|         3| 20000|
| Harsha| 21|         1| 15000|
|Shubham| 23|         2| 18000|
+-------+---+----------+------+

In [106]:
##salary of people less than or 20k
non_null.filter("Salary<=20000").show()

+-------+---+----------+------+
|   Name|age|experience|Salary|
+-------+---+----------+------+
|  Sunny| 29|         4| 20000|
|   Paul| 24|         3| 20000|
| Harsha| 21|         1| 15000|
|Shubham| 23|         2| 18000|
+-------+---+----------+------+

In [110]:
##salary of people less than or 20k
non_null.filter("Salary<=20000").select(["Name","Salary"]).show()

+-------+------+
|   Name|Salary|
+-------+------+
|  Sunny| 20000|
|   Paul| 20000|
| Harsha| 15000|
|Shubham| 18000|
+-------+------+

In [115]:
##salary of people less than or 20k and age>=24
non_null.filter((non_null["Salary"]<=20000)&(non_null["age"]>22)).select(["Name","Salary","age"]).show()

+-------+------+---+
|   Name|Salary|age|
+-------+------+---+
|  Sunny| 20000| 29|
|   Paul| 20000| 24|
|Shubham| 18000| 23|
+-------+------+---+

### groupby and aggregate Functions

In [118]:
non_null.show()

+--------+---+----------+------+
|    Name|age|experience|Salary|
+--------+---+----------+------+
|   Rohan| 23|        10| 30000|
|Sudanshu| 30|         8| 25000|
|   Sunny| 29|         4| 20000|
|    Paul| 24|         3| 20000|
|  Harsha| 21|         1| 15000|
| Shubham| 23|         2| 18000|
+--------+---+----------+------+

In [119]:
non_null.printSchema()

root
 |-- Name: string (nullable = true)
 |-- age: integer (nullable = true)
 |-- experience: integer (nullable = true)
 |-- Salary: integer (nullable = true)

In [142]:
##GroupBy 
##group by name to sum salary
non_null.groupby('name').sum("Salary").show()

+--------+-----------+
|    name|sum(Salary)|
+--------+-----------+
|   Sunny|      20000|
|Sudanshu|      25000|
|   Rohan|      30000|
|  Harsha|      15000|
|    Paul|      20000|
| Shubham|      18000|
+--------+-----------+

In [145]:
non_null.groupby('age').mean("Salary").show()

+---+-----------+
|age|avg(Salary)|
+---+-----------+
| 23|    24000.0|
| 24|    20000.0|
| 29|    20000.0|
| 21|    15000.0|
| 30|    25000.0|
+---+-----------+

In [147]:
#to count number of employees
non_null.groupby('age').count().show()

+---+-----+
|age|count|
+---+-----+
| 23|    2|
| 24|    1|
| 29|    1|
| 21|    1|
| 30|    1|
+---+-----+

In [152]:
##agg
non_null.agg({'Salary':'Sum'}).show()

+-----------+
|sum(Salary)|
+-----------+
|     128000|
+-----------+